Repository: dangnk146/dashboard-k8s-custom
Catalog: i18n/*/messages.*.xlf
Languages: de

source: Open notifications panel
de: Benachrichtigungsbereich öffnen

source: Close notifications panel
de: Benachrichtigungesbereich schließen

source: Edit a resource
de: Ressource bearbeiten

source: This action is equivalent to:
de: Diese Aktion ist äquivalent zu:

source: Update
de: Aktualisieren

source: Restart a resource
de: Ressource neu starten

source: This action is equivalent to:
de: Diese Aktion ist äquivalent zu:

source: Cancel
de: Abbrechen

source: Delete a resource
de: Ressource löschen

source: "[\uFFFD#5\uFFFD|\uFFFD#8\uFFFD]"Are you sure you want to delete "\uFFFD0\uFFFD" "[\uFFFD#6\uFFFD|\uFFFD#2:1\uFFFD]""\uFFFD1\uFFFD""[\uFFFD/#6\uFFFD|\uFFFD/#2:1\uFFFD]""[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]""\uFFFD*7:1\uFFFD\uFFFD#1:1\uFFFD" in namespace "[\uFFFD#6\uFFFD|\uFFFD#2:1\uFFFD]""\uFFFD0:1\uFFFD""[\uFFFD/#6\uFFFD|\uFFFD/#2:1\uFFFD]""[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]""[\uFFFD#5\uFFFD|\uFFFD#8\uFFFD]"?"[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]"
de: <span>Sind Sie sicher, dass Sie {{data.displayName}} <i>{{data.objectMeta.name}}</i></span> <span> im Namespace <i>{{data.objectMeta.namespace}}</i> </span> <span>löschen möchten?</span>

source: Delete
de: Löschen

source: Actions
de: Aktionen

source: Size: "\uFFFD0\uFFFD" B
de: Größe : {{loaded | kdMemory}} B

source: Preparing file to download...
de: Datei-Download wird vorbereitet...

source: File is ready to download!
de: Datei ist bereit zum Download!

source: Forbidden (403)
de: Verboten (403)

source: You do not have required permissions to access this resource.
de: Sie verfügen nicht über die notwendigen Berechtigungen, um auf dieses Ressource zuzugreifen.

source: Save
de: Speichern

source: Abort
de: Abbrechen

source: Close
de: Schließen

source: Logged in with auth header || VNPAY-OIDC
de: Angemeldet mit Auth Header

source: Logged in with token
de: Angemeldet mit Token

source: Default service account
de: Standard Service Account

source: Sign in
de: Anmelden

source: Sign out
de: Abmelden

source: Scale a resource
de: Ressource skalieren

source: "\uFFFD0\uFFFD" "\uFFFD1\uFFFD" will be updated to reflect the desired replicas count.
de: "\uFFFD0\uFFFD" "\uFFFD1\uFFFD" wird aktualisiert, um den gewünschte Replicas-Anzahl widerzuspiegeln.

source: Desired replicas
de: Gewünschte Anzahl an Replikas

source: Actual replicas
de: Tatsächliche Anzahl an Replikas

source: "[\uFFFD#5\uFFFD|\uFFFD#8\uFFFD]""\uFFFD0\uFFFD" "[\uFFFD#6\uFFFD|\uFFFD#2:1\uFFFD]""\uFFFD1\uFFFD" "[\uFFFD/#6\uFFFD|\uFFFD/#2:1\uFFFD]""[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]""\uFFFD*7:1\uFFFD\uFFFD#1:1\uFFFD" in namespace "[\uFFFD#6\uFFFD|\uFFFD#2:1\uFFFD]""\uFFFD0:1\uFFFD" "[\uFFFD/#6\uFFFD|\uFFFD/#2:1\uFFFD]""[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]""[\uFFFD#5\uFFFD|\uFFFD#8\uFFFD]"will be restarted."[\uFFFD/#5\uFFFD|\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD|\uFFFD/#8\uFFFD]"
de: <span>{{data.displayName}} <i>{{data.objectMeta.name}} </i></span><span *ngIf="data.objectMeta.namespace"> im Namespace <i>{{data.objectMeta.namespace}} </i></span><span>wird neu gestartet.</span>

source: Trigger a "\uFFFD0\uFFFD"
de: {{data.displayName}} auslösen

source: "\uFFFD0\uFFFD" "\uFFFD1\uFFFD" will be triggered.
de: {{data.displayName}} {{data.objectMeta.name}} wird ausgelöst.

source: Can't find plugin "pluginName"
de: Plugin "pluginName" konnte nicht gefunden werden

source: Can't find dependency "dep" for plugin "pluginName"
de: Dependency "dep" für Plugin "pluginName" konnte nicht gefunden werden

source: Local settings
de: Lokale Einstellungen

source: Suffix 'suffix' not recognized.
de: Suffix 'suffix' wurde nicht erkannt.

source: Workload Status
de: Status des Workloads

source: Resource information
de: Ressourcen-Informationen

source: Config and Storage
de: Konfiguration und Storage

source: Create new resource
de: Neue Ressource erstellen

source: There are no notifications
de: Es gibt keine Benachrichtigungen

source: Age:
de: Alter:

source: Age
de: Alter

source: Show less
de: Weniger anzeigen

source: Show all
de: Alles anzeigen

source: Filter objects by name
de: Objekte nach Namen filtern

source: Logs from
de: Logs von

source: Containers
de: Container

source: Init Containers
de: Init-Container

source: Download logs
de: Logs herunterladen

source: Invert colors
de: Farben umkehren

source: Reduce font size
de: Textgröße reduzieren

source: Show timestamps
de: Zeitstempel anzeigen

source: Auto-refresh (every "\uFFFD0\uFFFD" s.)
de: Automatisch aktualisieren (alle {{refreshInterval}} s.)

source: Show previous logs
de: Zeige vorherige Logs

source: Logs from "\uFFFD#2\uFFFD""[\uFFFD/#2\uFFFD|\uFFFD/#3\uFFFD]" to "\uFFFD#3\uFFFD""[\uFFFD/#2\uFFFD|\uFFFD/#3\uFFFD]" UTC
de: Logs von <kd-date [date]="podLogs?.info.fromDate" format="short"></kd-date> bis <kd-date [date]="podLogs?.info.toDate" format="short"></kd-date> UTC

source: Pod Selector
de: Pod-Selektor

source: Policy Types
de: Policy-Typen

source: Ingress Rules
de: Ingress-Regeln

source: Egress Rules
de: Egress-Regeln

source: Path
de: Pfad

source: Path Type
de: Pfadtyp

source: Exec
de: Ausführen

source: Trigger
de: Auslösen

source: Scale
de: Skalieren

source: Unpin
de: Lösen

source: Pin
de: Befestigen

source: Restart
de: Neu starten

source: Edit
de: Bearbeiten

source: There is nothing to display here
de: Es gibt hier nichts anzuzeigen

source: Roles
de: Rollen

source: Config and Storage
de: Konfiguration und Datenspeicherung

source: Settings
de: Einstellungen

source: About
de: Über

source: Resource Quotas
de: Ressourcen-Quotas

source: Restarts
de: Neustarts

source: Resource Limits
de: Ressourcenlimits

source: Resource name
de: Ressourcenname

source: Resource type
de: Ressourcentyp

source: Default
de: Standard

source: Default request
de: Standard-Request

source: Endpoint links are external links that will be open in a new tab.
de: Endpoint Links sind externe Links, die in einem neuen Tab geöffnet werden.

source: Endpoints "\uFFFD#2\uFFFD"open_in_new"\uFFFD/#2\uFFFD"
de: Endpoints <mat-icon class="external-link-icon kd-clickable" i18n-matTooltip matTooltip="Endpoint links are external links that will be open in a new tab.">open_in_new</mat-icon>

source: Host links are external links that will be open in a new tab.
de: Host Links sind externe Links, die in einem neuen Tab geöffnet werden.

source: Hosts "\uFFFD#2\uFFFD"open_in_new"\uFFFD/#2\uFFFD"
de: Hosts <mat-icon class="external-link-icon kd-clickable" i18n-matTooltip matTooltip="Host links are external links that will be open in a new tab.">open_in_new</mat-icon>

source: Config And Storage
de: Konfiguration und Speicherplatz

source: Internal Endpoints
de: Interne Endpoints

source: External Endpoints
de: Externe Endpoints

source: You can "\uFFFD#6\uFFFD"deploy a containerized app"[\uFFFD/#6\uFFFD|\uFFFD/#7\uFFFD]", select other namespace or "\uFFFD#7\uFFFD"take the Dashboard Tour "\uFFFD#8\uFFFD"open_in_new"\uFFFD/#8\uFFFD""[\uFFFD/#6\uFFFD|\uFFFD/#7\uFFFD]" to learn more.
de: Sie können <a>eine containerisierte App deployen</a>, einen anderen Namespace auswählen oder <a>die Dashboard-Tour starten <mat-icon>open_in_new</mat-icon> </a> um mehr zu erfahren.

source: Items:
de: Elemente:

source: Ports (Name, Port, Protocol)
de: Ports (Name, Port, Protokoll)

source: unset
de: nicht festgelegt

source: Events
de: Ereignisse

source: Overview
de: Übersicht

source: Ready
de: Bereit

source: Started
de: Gestartet

source: Unsupported graph type this.graphType.
de: Graphen vom Typ this.graphTypewerden nicht unterstützt.

source: Waiting for more data to display chart...
de: Warte auf mehr Daten zur Anzeige des Diagramms...

source: Source
de: Quelle

source: Object
de: Objekt

source: Sub-object
de: Sub-Objekt

source: Count
de: Anzahl

source: First Seen
de: Zuerst gesehen

source: Last Seen
de: Zuletzt gesehen

source: Min Replicas
de: Min Replikas

source: Max Replicas
de: Max Replikas

source: Reference
de: Referenz

source: Environment variable
de: Umgebungsvariable

source: Conditions
de: Bedingungen

source: Type
de: Typ

source: Preview Deployment
de: Vorschau des Deployments

source: Last probe time
de: Letzte Überprüfungszeit

source: Last transition time
de: Letzte Transitions-Zeit

source: Reason
de: Grund

source: Parameters
de: Parameter

source: Schedule
de: Planung

source: Suspend
de: Anhalten

source: Active
de: Aktiv

source: Last Schedule
de: Letzte Ausführung

source: Created
de: Erstellungszeitpunkt

source: Plugins
de: Erweiterungen

source: Dependencies
de: Abhängigkeiten

source: Message
de: Nachricht

source: Kind:
de: Art:

source: Controlled by
de: Kontrolliert von

source: Kind
de: Art

source: CPU requests (cores)
de: CPU-Reservierung (Kerne)

source: CPU limits (cores)
de: CPU-Limits (Kerne)

source: Memory requests (bytes)
de: Speicherreservierung (Bytes)

source: Memory limits (bytes)
de: Speicherlimit (Bytes)

source: Settings
de: Einstellungen

source: Group
de: Gruppe

source: Full Name
de: Vollständiger Name

source: Namespaced
de: Namespace-gebunden

source: Objects
de: Objekte

source: No resources found in the selected namespace.
de: Im ausgewählten Namespace wurden keine Ressourcen gefunden.

source: Versions
de: Versionen

source: Served
de: Ausgeliefert

source: Storage
de: Speicher

source: Namespaces
de: Namespace

source: Capacity
de: Kapazität

source: Pods status
de: Status des Pods

source: Running:
de: Läuft:

source: Succeeded:
de: Erfolgreich:

source: Pending:
de: Ausstehend:

source: Failed:
de: Fehlgeschlagen:

source: Desired:
de: Gewünscht:

source: Running
de: Läuft

source: Succeeded
de: Erfolgreich

source: Pending
de: Ausstehend

source: Failed
de: Fehlgeschlagen

source: Initial Delay (Seconds)
de: Initial Delay (in Sekunden)

source: Timeout (Seconds)
de: Timeout (in Sekunden)

source: Probe Period (Seconds)
de: Probe Period (in Sekunden)

source: Desired
de: Gewünscht

source: CPU Usage (cores)
de: CPU-Nutzung (Kerne)

source: Memory Usage (bytes)
de: Speichernutzung (Bytes)

source: Namespace conflict
de: Namespace-Konflikt

source: Selected namespace is different than namespace of currently selected resource.
de: Der ausgewählte Namespace unterscheidet sich vom Namespace der aktuell angewählten Ressource.

source: Do you want to stay on current page and change namespace from "[\uFFFD#7\uFFFD|\uFFFD#8\uFFFD]""\uFFFD0\uFFFD""[\uFFFD/#7\uFFFD|\uFFFD/#8\uFFFD]" to "[\uFFFD#7\uFFFD|\uFFFD#8\uFFFD]""\uFFFD1\uFFFD""[\uFFFD/#7\uFFFD|\uFFFD/#8\uFFFD]"?
de: Möchten Sie auf der aktuellen Seite verbleiben und den Namespace von <i>{{namespace}}</i> zu <i>{{newNamespace}}</i> ändern?

source: Yes
de: Ja

source: No
de: Nein

source: Select namespace...
de: Namespace auswählen...

source: All namespaces
de: Alle Namespaces

source: Rules
de: Regeln

source: Resources
de: Ressourcen

source: Non-resource URL
de: Nicht-Ressource URL

source: Resource Names
de: Ressourcenname

source: Verbs
de: Verben

source: API Groups
de: API-Gruppen

source: Delete resource
de: Ressource löschen

source: Edit resource
de: Ressource bearbeiten

source: Scale resource
de: Ressource skalieren

source: View logs
de: Logs ansehen

source: Unpin resource
de: Ressource lösen

source: Pin resource
de: Ressource fixieren

source: Exec into pod
de: In Pod ausführen

source: Trigger resource
de: Ressource triggern

source: Search for this._activatedRoute.snapshot.queryParams[SEARCH_QUERY_STATE_PARAM]
de: Nach this._activatedRoute.snapshot.queryParams[SEARCH_QUERY_STATE_PARAM] suchen

source: Download logs file
de: Logs-Datei herunterladen

source: No resources found.
de: Es wurden keine Ressourcen gefunden.

source: Read documentation
de: Dokumentation lesen

source: Provide feedback
de: Feedback geben

source: Resource Information
de: Ressource-Informationen

source: Subresources
de: Sub-Ressourcen

source: Accepted Names
de: Akzeptierte Namen

source: List Kind
de: Listen-Typ

source: Short Names
de: Abkürzungen

source: Categories
de: Kategorien

source: About
de: Über

source: General-purpose web UI for Kubernetes clusters
de: Allgemeine Web-Benutzeroberfläche für Kubernetes-Cluster

source: Kubernetes Dashboard is made possible by the Dashboard "\uFFFD#16\uFFFD"community"[\uFFFD/#16\uFFFD|\uFFFD/#17\uFFFD]" as an "\uFFFD#17\uFFFD"open source project"[\uFFFD/#16\uFFFD|\uFFFD/#17\uFFFD]".
de: Das Kubernetes-Dashboard wird ermöglicht durch die Dashboard <a>Community</a> als <a>Open-Source-Projekt</a>.

source: Global settings
de: Globale Einstellungen

source: Global settings are stored in config map, so all of them are applied for every instance of the app.
de: Globale Einstellungen werden in einer Config Map abgelegt und finden damit Anwendung auf alle Instanzen der App.

source: Search
de: Suchen

source: Remove all notifications
de: Alle Benachrichtigungen löschen

source: "\uFFFD0\uFFFD"
de: {{getDisplayName(resource)}}

source: Minimize card
de: Karte minimieren

source: Unknown
de: Unbekannt

source: Expand card
de: Karte erweitern

source: Role Reference
de: Role-Referenzen

source: Please select the kubeconfig file that you have created to configure access to the cluster. To find out more about how to configure and use kubeconfig file, please refer to the "\uFFFD#2\uFFFD"Configure Access to Multiple Clusters"\uFFFD/#2\uFFFD" section.
de: Bitte wählen Sie eine Kubeconfig-Datei, die verwendet werden kann, um auf das Cluster zuzugreifen. Um mehr über die Konfigurationsoption und die allgemeine Benutzung der Kubeconfig-Datei zu erfahren, konsultieren Sie den Abschnitt <a>Zugang zu mehreren Clustern konfigurieren</a>.

source: Make sure that support for basic authentication is enabled in the cluster. To find out more about how to configure basic authentication, please refer to the "\uFFFD#2\uFFFD"Authenticating"[\uFFFD/#2\uFFFD|\uFFFD/#3\uFFFD]" and "\uFFFD#3\uFFFD"ABAC Mode"[\uFFFD/#2\uFFFD|\uFFFD/#3\uFFFD]" sections.
de: Sellen Sie sicher, dass die Unterstützung für Basic Authentication für das Cluster aktiviert ist. Um mehr über die Konfiguration von Basic Authentication zu erfahren, konsultieren Sie die Abschnitte <a>Authentifizierung</a> und <a>ABAC-Modus</a>.

source: Every Service Account has a Secret with valid Bearer Token that can be used to log in to Dashboard. To find out more about how to configure and use Bearer Tokens, please refer to the "\uFFFD#2\uFFFD"Authentication"\uFFFD/#2\uFFFD" section.
de: Jeder Service Account verfügt über ein Secret mit einem gültigen Bearer Token, welches verwendet werden kann, um sich am Dashboard anzumelden. Um mehr über die Konfiguration und Nutzung von Bearer Tokens zu erfahren, konsultieren Sie den Abschnitt <a>Authentifizierung</a>.

source: Enter token
de: Token eingeben

source: Username
de: Benutzername

source: Password
de: Kennwort

source: Choose kubeconfig file
de: Kubeconfig-Datei auswählen

source: Insecure access detected. Sign in will not be available. Access Dashboard securely over HTTPS or using localhost. Read more "\uFFFD#2\uFFFD" here "\uFFFD/#2\uFFFD".
de: Unsicherer Zugriff erkannt. Anmeldung nicht verfügbar. Greifen Sie auf das Dashboard gesichert per HTTPS zu oder nutzen Sie localhost. Mehr dazu können Sie <a> hier </a> lesen.

source: Sign in
de: Anmelden

source: Skip
de: Überspringen

source: Create from input
de: Aus Texteingabe erstellen

source: Create from file
de: Aus Datei erstellen

source: Create from form
de: Aus Formular erstellen

source: Shell in "\uFFFD*3:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD*2:2\uFFFD\uFFFD#1:2\uFFFD" "\uFFFD0:2\uFFFD" "\uFFFD/#1:2\uFFFD\uFFFD/*2:2\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*3:1\uFFFD" in "\uFFFD0\uFFFD"
de: Shell in <mat-select> <mat-option> {{ item }} </mat-option> </mat-select> in {{ podName }}

source: Create a new namespace
de: Neuen Namespace erstellen

source: The new namespace will be added to the cluster.
de: Der Namespace wird dem Cluster hinzugefügt.

source: Name is required.
de: Ein Name wird benötigt.

source: Create a new image pull secret
de: Neues Image Pull Secert erstellen

source: The new secret will be added to the cluster
de: Das neue Secret wird dem Cluster hinzugefügt

source: Name must be up to "\uFFFD0\uFFFD" characters long.
de: Der Name darf bis zu {{namespaceMaxLength}} Zeichen lang sein.

source: Name must be alphanumeric and may contain dashes.
de: Der Name muss aus alphanumerischen Zeichen bestehen und darf Bindestriche enthalten.

source: Go to namespace
de: Gehe zu Namespace

source: A namespace with the specified name will be added to the cluster.
de: Ein Namespace mit dem angegeben Namen wird dem Cluster hinzugefügt.

source: Create
de: Erstellen

source: Learn more "\uFFFD#5\uFFFD"open_in_new"\uFFFD/#5\uFFFD"
de: Mehr erfahren <i> open_in_new </i>

source: Create
de: Erstellen

source: Name must follow the DNS domain name syntax (e.g. new.image-pull.secret).
de: Der Name muss im Format der DNS Domain Name Syntax sein (z.B. new.image-pull.secret).

source: A secret with the specified name will be added to the cluster in the namespace.
de: Ein Secret mit dem angegebenen Namen wird dem Cluster im Namespace hinzugefügt.

source: Data is required.
de: Daten werden benötigt.

source: Data must be Base64 encoded.
de: Daten müssen Base64-codiert sein.

source: Specify the data for your secret to hold. The value is the Base64 encoded content of a .dockercfg file.
de: Legen Sie die Daten fest, die das Secret beinhalten soll. Der Wert entspricht dem Base64-kodierten Inhalt einer .dockercfg-Datei.

source: App name
de: Applikationsname

source: Deployment or service with this name already exists within namespace.
de: Ein Deployment oder Service mit dem angegebenen Namen existiert bereits in diesem Namespace.

source: Application name is required.
de: Ein Applikationsname wird benötigt.

source: Application name must start with a lowercase letter and contain only lowercase letters, numbers, and '-' between words.
de: Ein Applikationsname muss mit einem Kleinbuchstaben beginnen und darf ausschließlich Kleinbuchstaben, Ziffern und '-' zwischen Wörtern enthalten.

source: An 'app' label with this value will be added to the Deployment and Service that get deployed.
de: Ein 'app'-Label mit dem angegeben Wert wird dem Deployment oder Service, der bereitgestellt wird angefügt.

source: Learn more "\uFFFD#15\uFFFD"open_in_new"\uFFFD/#15\uFFFD"
de: Mehr erfahren <i> open_in_new </i>

source: Container image is required
de: Ein Container-Image muss angegeben werden

source: Container image is invalid: "\uFFFD0\uFFFD"
de: Das angegebene Container-Image ist ungültig: {{containerImage.errors?.validImageReference}}

source: Enter the URL of a public image on any registry, or a private image hosted on Docker Hub or Google Container Registry.
de: Geben Sie die URL eines öffentlichen Images in einer beliebigen Registry oder ein privates Image, welches auf Docker Hub oder der Google Container Registry zu finden ist.

source: Number of pods
de: Anzahl Pods

source: Number of pods is required
de: Anzahl Pods wird benötigt

source: Number of pods must be a positive integer
de: Anzahl Pods muss ein positiver ganzzahliger Wert sein

source: Setting high number of pods may cause performance issues of the cluster and Dashboard UI.
de: Die Einstellung einer hohen Anzahl Pods kann zu Performance-Problemen des Clusters und der grafischen Oberfläche des Dashboards führen.

source: A Deployment will be created to maintain the desired number of pods across your cluster.
de: Ein Deployment, welches die gewünschte Anzahl Pods über das Cluster verteilt sicherstellt, wird erzeugt.

source: Optionally, an internal or external Service can be defined to map an incoming Port to a target Port seen by the container.
de: Wahlweise kann ein interner oder externer Service definiert werden, der einen eingehenden Port auf einen Ziel-Port des Containers abbildet.

source: Description
de: Beschreibung

source: The description will be added as an annotation to the Deployment and displayed in the application's details.
de: Die Beschreibung wird als Annotation an das Deployment angefügt und in den Applikationsdetails angezeigt.

source: The specified labels will be applied to the created Deployment, Service (if any) and Pods. Common labels include release, environment, tier, partition and track.
de: Die angegebenen Labels werden auf die erstellten Deployments, den Service (falls vorhanden) und die Pods angewendet. Zu den gängigen Labels gehören Release, Environment, Ebene, Partition und Track.

source: Learn more "\uFFFD#64\uFFFD"open_in_new"\uFFFD/#64\uFFFD"
de: Mehr erfahren <i> open_in_new </i>

source: Create a new namespace...
de: Neuen Namespace erstellen...

source: Namespaces let you partition resources into logically named groups.
de: Namespaces ermöglichen es, Ressourcen in logisch benannte Gruppen zu unterteilen.

source: Create a new secret...
de: Neues Secret erstellen...

source: The specified image could require a pull secret credential if it is private. You may choose an existing secret or create a new one.
de: Das agegebene Image könnte Pull Secret Anmeldeinformationen benötigen, falls es privat ist. Sie können ein bestehendes Secret wählen oder ein Neues erstellen.

source: CPU requirement (cores)
de: CPU-Anforderung (Kerne)

source: CPU requirement must be given as a positive number.
de: CPU-Anforderung muss als postive Ganzzahl angegeben werden.

source: CPU requirement must be given as a valid number.
de: CPU-Anforderung muss als gültive Zahl angegeben werden.

source: Memory requirement (MiB)
de: Speicheranforderung (MiB)

source: Memory requirement must be given as a positive number.
de: Speicheranforderung muss als postive Zahl angegeben werden.

source: Memory requirement must be given as a valid number.
de: Speicheranforderung muss als gültige Zahl angegeben werden.

source: You can specify minimum CPU and memory requirements for the container.
de: Sie können die Minimalanforderungen an CPU und Speicher für den Container angeben.

source: Run command
de: Kommando ausführen

source: Run command arguments
de: Parameters des auszuführenden Kommandos

source: By default, your containers run the selected image's default entrypoint command. You can use the command options to override the default.
de: Standardmäßig führen Ihre Container das Standard Einstiegspunktkommand des ausgewählten Images aus. Sie können die Befehlsoptionen verwenden, um die Standardeinstellung zu überschreiben.

source: Run as privileged
de: Als priviligiert ausführen

source: Processes in privileged containers are equivalent to processes running as root on the host.
de: Prozesse in privilegierten Containern entsprechen Prozessen, die als root auf dem Host ausgeführt werden.

source: Environment variables available for use in the container. Values can reference other variables using $(VAR_NAME) syntax.
de: Umgebungsvariablen zur Verwendung im Container. Werte können mithilfe der Syntax $(VAR_NAME) auf andere Variablen verweisen.

source: Preview
de: Vorschau

source: {VAR_SELECT, select, true {Hide advanced options} other {Show advanced options}}
de: {VAR_SELECT, select, true {Erweiterte Optionen ausblenden} other {Erweiterte Optionen anzeigen}}

source: i18n_81
de: {isMoreOptionsEnabled(), select, 1 {...} other {...}}

source: Enter YAML or JSON content specifying the resources to create to the namespace specified in the file.
de: Geben Sie den YAML- oder JSON-Inhalt an, der die Ressource beschreibt, die im Namespace, der in der Datei referenziert wird, erstellt werden soll.

source: Enter YAML or JSON content specifying the resources to create to the currently selected namespace.
de: Geben Sie den YAML- oder JSON-Inhalt an, der die Ressource beschreibt, die im aktuell angewählten Namespace erzeugt werden soll.
