Repository: dangnk146/dashboard-k8s-custom
Catalog: i18n/*/messages.*.xlf
Languages: de

source: Upload
de: Hochladen

source: Select YAML or JSON file specifying the resources to deploy to the namespace specified in the file.
de: Geben Sie den YAML- oder JSON-Datei an, welche die Ressource beschreibt, die im Namespace, welcher in der Datei referenziert wird, erzeugt werden soll.

source: Select YAML or JSON file specifying the resources to deploy to the currently selected namespace.
de: YAML- oder JSON-Datei auswählen, welche die Ressource beschreibt, die im aktuell angewählten Namespace erzeugt werden soll.

source: Choose YAML or JSON file
de: YAML- oder JSON-Datei auswählen

source: Upload
de: Hochladen

source: Cancel
de: Abbrechen

source: Environment variables
de: Umgebungsvariablen

source: Variable name must be a valid C identifier.
de: Der Variablenname muss ein gültiger C Bezeichner sein.

source: Value
de: Wert

source: Port must be an integer.
de: Post muss ein ganzzahliger Wert sein.

source: Port cannot be empty.
de: Port kann nicht weggelassen werden.

source: Port must be greater than 0.
de: Port muss größer als 0 sein.

source: Port must be less than 65536.
de: Port muss kleiner als 65536 sein.

source: Target port
de: Ziel-Port

source: Target port must be an integer.
de: Ziel-Port muss ein ganzzahliger Wert sein.

source: Target port cannot be empty.
de: Ziel-Port kann nicht weggelassen werden.

source: Target port must be greater than 0.
de: Ziel-Port muss größer als 0 sein.

source: Target port must be less than 65536.
de: Ziel-Port muss kleiner als 65536 sein.

source: Protocol
de: Protokoll

source: Protocol is required.
de: Das Protokoll muss angegeben werden.

source: Invalid protocol.
de: Ungültiges Protokoll.

source: Failed: status.failed
de: Fehlgeschlagen: status.failed

source: Pending: status.pending
de: Ausstehend: status.pending

source: Succeeded: status.succeeded
de: Erfolgreich: status.succeeded

source: "\uFFFD0\uFFFD" is not unique
de: {{label.get('key').value}} ist nicht eindeutig

source: Prefix is not a valid DNS subdomain prefix (eg. my-domain.com).
de: Das Prefix ist kein gültiger DNS Subdomain-Prefix (z.B. meine-domain.com).

source: Label key name must be alphanumeric separated by '-', '_' or '.', optionally prefixed by a DNS subdomain and '/'.
de: Label Key Namen dürfen ausschließlich aus alphanumerischen Zeichen, getrennt durch '-', '_' oder '.' enthalten, wahlweise mit einem DNS Subdomain Namen und '/' als Präfix.

source: Prefix should not exceed 253 characters.
de: Das Präfix sollte nicht länger als 253 Zeichen sein.

source: Label Key name should not exceed 63 characters.
de: Der Label Key Name sollte nicht länger als 63 Zeichen sein.

source: value
de: Wert

source: Label value must be alphanumeric separated by '.' , '-' or '_'.
de: Der Label Wert muss alphanumerisch und durch '.', '-' oder '_' getrennt sein.

source: Label Value must not exceed 253 characters.
de: Der Label Wert sollte nicht länger als 254 Zeichen sein.

source: Pod CIDR
de: CIDR des Pods

source: Unschedulable
de: Nicht planbar

source: Addresses
de: Adressen

source: Machine ID
de: Maschinen-ID

source: System UUID
de: UUID des Systems

source: OS Image
de: Betriebssystem

source: Container runtime version
de: Version der Container-Laufzeitumgebung

source: Operating system
de: Betriebssystem

source: Architecture
de: Architektur

source: Allocation
de: Zuordnung

source: Memory
de: Speicher

source: Mount Option(s)
de: Mount Optionen

source: Access modes
de: Zugriffsarten

source: Quantity
de: Anzahl

source: Path
de: Pfad

source: Volume Attributes
de: Volume Attribute

source: Data
de: Daten

source: There is no data to display.
de: Keine Daten zum anzeigen vorhanden.

source: Session Affinity
de: Sitzungsaffinität

source: Selector
de: Selektor

source: Old Replica Sets
de: Alte Replica Sets

source: Schedule:
de: Planung:

source: Active Jobs:
de: Aktive Jobs :

source: Suspend:
de: Anhalten:

source: Active Jobs
de: Aktive Jobs

source: Last schedule
de: Letzte Planung

source: Concurrency policy
de: Parallelitätsrichtlinie

source: Starting deadline seconds
de: Starting deadline in Sekunden

source: Inactive Jobs
de: Inaktive Jobs

source: Strategy:
de: Strategie:

source: Min ready seconds:
de: Minimale Sekunden in Bereitschaft:

source: Revision history limit:
de: Revisionsverlaufslimit:

source: Strategy
de: Strategie

source: Min ready seconds
de: Minimale Sekunden in Bereitschaft

source: Revision history limit
de: Revisionsverlaufslimit

source: Rolling update strategy
de: Strategie für Rolling Updates

source: Max surge:
de: Maximaler Anstieg:

source: Max unavailable:
de: Maximal nicht verfügbar:

source: Max surge
de: Maximaler Anstieg

source: Max unavailable
de: Maximal nicht verfügbar

source: Updated:
de: Aktualisiert:

source: Total:
de: Gesamt :

source: Available:
de: Verfügbar :

source: Unavailable:
de: Nicht verfügbar :

source: Updated
de: Aktualisiert

source: Total
de: Gesamt

source: Available
de: Verfügbar

source: Unavailable
de: Nicht verfügbar

source: New Replica Set
de: Neues Replica Set

source: Completions:
de: Abschlüsse:

source: Parallelism:
de: Parallelität:

source: Completions
de: Abschlüsse

source: Parallelism
de: Parallelität

source: Label Selector
de: Label Selektor

source: Settings have changed since last reload
de: Einstellungen wurden seit dem letzten Neuladen verändert

source: Do you want to save them anyways?
de: Wollen Sie sie trotzdem speichern?

source: Refresh
de: Aktualisieren

source: Default namespace
de: Standard-Namespace

source: Namespace that should be selected by default after logging in.
de: Namespace der standardmäßig selektiert werden soll nachdem eine Anmeldung erfolgt ist.

source: Namespace fallback list
de: Namespace Fallback-Liste

source: List of namespaces that should be presented to user without namespace list privileges.
de: Namespaces die dem Nutzer auch ohne "namespace list"-Privilegien angezeigt werden sollen.

source: Add namespaces...
de: Namespaces hinzufügen...

source: Edit Namespace List
de: Namespace-Liste editieren

source: Remove namespaces from the list and confirm to save the changes.
de: Namespace von der Liste entfernen und bestätigen .

source: No namespaces selected
de: Keine Namespaces ausgewählt

source: Add Namespace
de: Namespace hinzufügen

source: Provide a namespace name that should be added to the namespace fallback list
de: Einen Namespace Namen angeben, der zur Namespace Fallback-Liste hinzugefügt werden soll

source: Add
de: Hinzufügen

source: Cluster name
de: Name des Clusters

source: Cluster name appears in the browser window title if it is set.
de: Der Name des Clusters taucht im Titel des Browser-Fensters auf, wenn er festgelegt wurde.

source: Items per page
de: Elemente pro Seite

source: Max number of items that can be displayed on every list view.
de: Maximale Anzahl an Einträgen, die in jeder Listenansicht zeitgleich sichtbar sind.

source: Max number of labels that are displayed by default on most views.
de: Maximale Anzahl an Labels, die standardmäßig in den meisten Ansichten zu sehen sind.

source: Logs auto-refresh time interval
de: Intervall der automatischen Aktualisierung der Logs

source: Number of seconds between every auto-refresh of logs.
de: Anzahl Sekunden zwischen den automatischen Aktualisierungen der Logs.

source: Resource auto-refresh time interval
de: Intervall der automatischen Aktualisierung von Ressourcen

source: Number of seconds between every auto-refresh of every resource. Set 0 to disable.
de: Anzahl Sekunden zwischen der automatischen Aktualisierung jeder Ressource. Ein Wert von 0 deaktiviert die automatische Aktualisierung.

source: Disable access denied notification
de: Zugriff verweigert Benachrichtigungen deaktivieren

source: Hides all access denied warnings in the notification panel.
de: Verbirgt alle Zugriff verweigert Benachrichtigungen im Benachrichtigungsbereich.

source: Reload
de: Neu laden

source: Local settings are stored in the browser cookies, so they are not synchronized between multiple devices. Changes are applied automatically on every change.
de: Lokale Einstellungen werden in Cookies innerhalb des Browsers gespeichert und werden folglich nicht zwischen verschiedenen Geräten synchronisiert. Änderungen werden automatisch angewendet.

source: Choose color theme of the dashboard
de: Color Theme des Dashboards auswählen

source: Language
de: Sprache

source: Change the language of the dashboard
de: Ändern Sie die Sprache des Dashboards
